RollandMichael7/nrf52-ble-multi-link-multi-role/ble_aggregator/app_aggregator.c
    // Update local device list
    device_disconnected(conn_handle);
       
    // Send info to central device (if connected)
    tx_command_payload[0] = AGG_BLE_LINK_DISCONNECTED;
    tx_command_payload[1] = ble_gap_evt->conn_handle >> 8;
    tx_command_payload[2] = ble_gap_evt->conn_handle & 0xFF;
    tx_command_payload_length = 3;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}

void app_aggregator_data_update(uint16_t conn_handle, uint8_t *p_data, uint32_t length)
{
    if(length <= 255)
    {
        tx_command_payload[0] = AGG_BLE_LINK_DATA_UPDATE;
        tx_command_payload[1] = conn_handle >> 8;
        tx_command_payload[2] = conn_handle & 0xFF;
        tx_command_payload[3] = length & 0xFF;
        memcpy(&tx_command_payload[4], p_data, length);
        tx_command_payload_length = length + 4;
        cmd_buffer_put(tx_command_payload, tx_command_payload_length);
    }
}

void app_aggregator_data_update_by_index(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_LINK_DATA_UPDATE;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = 3;
    tx_command_payload[4] = m_link_info_list[device_index].button_state;
    tx_command_payload[5] = m_link_info_list[device_index].rf_phy;
    tx_command_payload[6] = m_link_info_list[device_index].last_rssi;
    tx_command_payload_length = 7;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);    
}

void app_aggregator_data_update_battery(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_BATTERY;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = m_link_info_list[device_index].battery_level;
    tx_command_payload_length = 4;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}

void app_aggregator_data_update_conn_param(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_CONN_PARAM;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = LSB_16(m_link_info_list[device_index].conn_params.min_interval);
    tx_command_payload[4] = MSB_16(m_link_info_list[device_index].conn_params.min_interval);
    tx_command_payload[5] = LSB_16(m_link_info_list[device_index].conn_params.max_interval);
    tx_command_payload[6] = MSB_16(m_link_info_list[device_index].conn_params.max_interval);
    tx_command_payload[7] = LSB_16(m_link_info_list[device_index].conn_params.slave_latency);
    tx_command_payload[8] = MSB_16(m_link_info_list[device_index].conn_params.slave_latency);
    tx_command_payload[9] = LSB_16(m_link_info_list[device_index].conn_params.sup_timeout);
    tx_command_payload[10] = MSB_16(m_link_info_list[device_index].conn_params.sup_timeout);
    tx_command_payload_length = 11;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}

void app_aggregator_data_update_env_config(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_ENV_CONFIG;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = LSB_16(m_link_info_list[device_index].env_config.temp_interval);
    tx_command_payload[4] = MSB_16(m_link_info_list[device_index].env_config.temp_interval);
    tx_command_payload[5] = LSB_16(m_link_info_list[device_index].env_config.pressure_interval);
    tx_command_payload[6] = MSB_16(m_link_info_list[device_index].env_config.pressure_interval);
    tx_command_payload[7] = LSB_16(m_link_info_list[device_index].env_config.humid_interval);
    tx_command_payload[8] = MSB_16(m_link_info_list[device_index].env_config.humid_interval);
    tx_command_payload[9] = LSB_16(m_link_info_list[device_index].env_config.color_interval);
    tx_command_payload[10] = MSB_16(m_link_info_list[device_index].env_config.color_interval);
    tx_command_payload[11] = m_link_info_list[device_index].env_config.gas_mode;
    tx_command_payload[12] = m_link_info_list[device_index].env_config.led_red;
    tx_command_payload[13] = m_link_info_list[device_index].env_config.led_green;
    tx_command_payload[14] = m_link_info_list[device_index].env_config.led_blue;
    tx_command_payload_length = 15;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}

void app_aggregator_data_update_temperature(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_TEMPERATURE;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = m_link_info_list[device_index].temperature.integer;
    tx_command_payload[4] = m_link_info_list[device_index].temperature.decimal;
    tx_command_payload_length = 5;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}

void app_aggregator_data_update_pressure(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_PRESSURE;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = m_link_info_list[device_index].pressure.integer[0];
    tx_command_payload[4] = m_link_info_list[device_index].pressure.integer[1];
    tx_command_payload[5] = m_link_info_list[device_index].pressure.integer[2];
    tx_command_payload[6] = m_link_info_list[device_index].pressure.integer[3];
    tx_command_payload[7] = m_link_info_list[device_index].pressure.decimal;
    tx_command_payload_length = 8;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}

void app_aggregator_data_update_humidity(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_HUMIDITY;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = m_link_info_list[device_index].humidity.value;
    tx_command_payload_length = 4;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}

void app_aggregator_data_update_gas(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_GAS;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = m_link_info_list[device_index].gas.co[0];
    tx_command_payload[4] = m_link_info_list[device_index].gas.co[1];
    tx_command_payload[5] = m_link_info_list[device_index].gas.tvoc[0];
    tx_command_payload[6] = m_link_info_list[device_index].gas.tvoc[1];
    tx_command_payload_length = 7;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}


void app_aggregator_data_update_motion_config(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_MOTION_CONFIG;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = LSB_16(m_link_info_list[device_index].motion_config.step_interval);
    tx_command_payload[4] = MSB_16(m_link_info_list[device_index].motion_config.step_interval);
    tx_command_payload[5] = LSB_16(m_link_info_list[device_index].motion_config.temp_compensation_interval);
    tx_command_payload[6] = MSB_16(m_link_info_list[device_index].motion_config.temp_compensation_interval);
    tx_command_payload[7] = LSB_16(m_link_info_list[device_index].motion_config.magnet_compensation_interval);
    tx_command_payload[8] = MSB_16(m_link_info_list[device_index].motion_config.magnet_compensation_interval);
    tx_command_payload[9] = LSB_16(m_link_info_list[device_index].motion_config.frequency);
    tx_command_payload[10] = MSB_16(m_link_info_list[device_index].motion_config.frequency);
    tx_command_payload[11] = m_link_info_list[device_index].motion_config.wake_on_motion;
    tx_command_payload_length = 12;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}


void app_aggregator_data_update_quaternions(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_QUATERNIONS;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = m_link_info_list[device_index].quaternions.w[0];
    tx_command_payload[4] = m_link_info_list[device_index].quaternions.w[1];
    tx_command_payload[5] = m_link_info_list[device_index].quaternions.w[2];
    tx_command_payload[6] = m_link_info_list[device_index].quaternions.w[3];
    tx_command_payload[7] = m_link_info_list[device_index].quaternions.x[0];
    tx_command_payload[8] = m_link_info_list[device_index].quaternions.x[1];
    tx_command_payload[9] = m_link_info_list[device_index].quaternions.x[2];
    tx_command_payload[10] = m_link_info_list[device_index].quaternions.x[3];
    tx_command_payload[11] = m_link_info_list[device_index].quaternions.y[0];
    tx_command_payload[12] = m_link_info_list[device_index].quaternions.y[1];
    tx_command_payload[13] = m_link_info_list[device_index].quaternions.y[2];
    tx_command_payload[14] = m_link_info_list[device_index].quaternions.y[3];
    tx_command_payload[15] = m_link_info_list[device_index].quaternions.z[0];
    tx_command_payload[16] = m_link_info_list[device_index].quaternions.z[1];
    tx_command_payload[17] = m_link_info_list[device_index].quaternions.z[2];
    tx_command_payload[18] = m_link_info_list[device_index].quaternions.z[3];
    tx_command_payload_length = 19;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}

