RollandMichael7/nrf52-ble-multi-link-multi-role/ble_aggregator/app_aggregator.c
void app_aggregator_data_update_raw_motion(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_RAW_MOTION;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = m_link_info_list[device_index].raw_motion.accel.x[0];
    tx_command_payload[4] = m_link_info_list[device_index].raw_motion.accel.x[1];
    tx_command_payload[5] = m_link_info_list[device_index].raw_motion.accel.y[0];
    tx_command_payload[6] = m_link_info_list[device_index].raw_motion.accel.z[0];
    tx_command_payload[7] = m_link_info_list[device_index].raw_motion.accel.z[1];
    tx_command_payload[8] = m_link_info_list[device_index].raw_motion.gyro.x[0];
    tx_command_payload[9] = m_link_info_list[device_index].raw_motion.gyro.x[1];
    tx_command_payload[10] = m_link_info_list[device_index].raw_motion.gyro.y[0];
    tx_command_payload[11] = m_link_info_list[device_index].raw_motion.gyro.y[1];
    tx_command_payload[12] = m_link_info_list[device_index].raw_motion.gyro.z[0];
    tx_command_payload[13] = m_link_info_list[device_index].raw_motion.gyro.z[1];
    tx_command_payload[14] = m_link_info_list[device_index].raw_motion.compass.x[0];
    tx_command_payload[15] = m_link_info_list[device_index].raw_motion.compass.x[1];
    tx_command_payload[16] = m_link_info_list[device_index].raw_motion.compass.y[0];
    tx_command_payload[17] = m_link_info_list[device_index].raw_motion.compass.y[1];
    tx_command_payload[18] = m_link_info_list[device_index].raw_motion.compass.z[0];
    tx_command_payload[19] = m_link_info_list[device_index].raw_motion.compass.z[1];
    tx_command_payload_length = 20;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}

void app_aggregator_data_update_euler(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_EULER;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = m_link_info_list[device_index].euler.roll[0];
    tx_command_payload[4] = m_link_info_list[device_index].euler.roll[1];
    tx_command_payload[5] = m_link_info_list[device_index].euler.roll[2];
    tx_command_payload[6] = m_link_info_list[device_index].euler.roll[3];
    tx_command_payload[7] = m_link_info_list[device_index].euler.pitch[0];
    tx_command_payload[8] = m_link_info_list[device_index].euler.pitch[1];
    tx_command_payload[9] = m_link_info_list[device_index].euler.pitch[2];
    tx_command_payload[10] = m_link_info_list[device_index].euler.pitch[3];
    tx_command_payload[11] = m_link_info_list[device_index].euler.yaw[0];
    tx_command_payload[12] = m_link_info_list[device_index].euler.yaw[1];
    tx_command_payload[13] = m_link_info_list[device_index].euler.yaw[2];
    tx_command_payload[14] = m_link_info_list[device_index].euler.yaw[3];
    tx_command_payload_length = 15;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}

void app_aggregator_data_update_heading(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_HEADING;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = m_link_info_list[device_index].heading.value[0];
    tx_command_payload[4] = m_link_info_list[device_index].heading.value[1];
    tx_command_payload[5] = m_link_info_list[device_index].heading.value[2];
    tx_command_payload[6] = m_link_info_list[device_index].heading.value[3];
    tx_command_payload_length = 15;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}

void app_aggregator_data_update_rssi(uint16_t device_index)
{
    tx_command_payload[0] = AGG_BLE_RSSI;
    tx_command_payload[1] = m_link_info_list[device_index].conn_handle >> 8;
    tx_command_payload[2] = m_link_info_list[device_index].conn_handle & 0xFF;
    tx_command_payload[3] = m_link_info_list[device_index].last_rssi;
    tx_command_payload_length = 4;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);
}

void app_aggregator_all_led_update(uint8_t button_state)
{
    tx_command_payload[0] = AGG_BLE_LED_BUTTON_PRESSED;
    tx_command_payload[1] = button_state;
    tx_command_payload_length = 2;
    cmd_buffer_put(tx_command_payload, tx_command_payload_length);  
}

void app_aggregator_on_blinky_data(uint16_t conn_handle, uint8_t button_state)
{
    uint16_t device_index = device_list_search(conn_handle);
    if(device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].button_state = button_state;
        app_aggregator_data_update_by_index(device_index);
        //app_aggregator_data_update(conn_handle, &button_state, 1);
        m_schedule_device_list_print = true;
    }
}

void app_aggregator_on_battery_data(uint16_t conn_handle, uint8_t battery_level)
{
    uint16_t device_index = device_list_search(conn_handle);
    if(device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].battery_level = battery_level;
        app_aggregator_data_update_battery(device_index);
        m_schedule_device_list_print = true;
    }
}

void app_aggregator_on_conn_param_data(uint16_t conn_handle, ble_thingy_config_conn_param_t params)
{ 
    uint16_t device_index = device_list_search(conn_handle);
    if(device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].conn_params = params;
        app_aggregator_data_update_conn_param(device_index);
        m_schedule_device_list_print = true;
    }
}

void app_aggregator_on_env_config_data(uint16_t conn_handle, ble_thingy_weather_c_config_t config)
{
    uint16_t device_index = device_list_search(conn_handle);
    if (device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].env_config = config;
        app_aggregator_data_update_env_config(device_index);
        m_schedule_device_list_print = true;
    }
}

void app_aggregator_on_temperature_data(uint16_t conn_handle, ble_thingy_weather_temperature_t temperature)
{
    uint16_t device_index = device_list_search(conn_handle);
    if (device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].temperature = temperature;
        app_aggregator_data_update_temperature(device_index);
        m_schedule_device_list_print = true;
    }
}

