RollandMichael7/nrf52-ble-multi-link-multi-role/ble_aggregator/app_aggregator.c
void app_aggregator_on_pressure_data(uint16_t conn_handle, ble_thingy_weather_pressure_t pressure)
{
    uint16_t device_index = device_list_search(conn_handle);
    if (device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].pressure = pressure;
        app_aggregator_data_update_pressure(device_index);
        m_schedule_device_list_print = true;
    }
}

void app_aggregator_on_humidity_data(uint16_t conn_handle, ble_thingy_weather_humidity_t humidity)
{
    uint16_t device_index = device_list_search(conn_handle);
    if (device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].humidity = humidity;
        app_aggregator_data_update_humidity(device_index);
        m_schedule_device_list_print = true;
    }
}

void app_aggregator_on_gas_data(uint16_t conn_handle, ble_thingy_weather_gas_t gas)
{
    uint16_t device_index = device_list_search(conn_handle);
    if (device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].gas = gas;
        app_aggregator_data_update_gas(device_index);
        m_schedule_device_list_print = true;
    }
}


void app_aggregator_on_motion_config_data(uint16_t conn_handle, ble_thingy_motion_c_config_t config)
{
    uint16_t device_index = device_list_search(conn_handle);
    if (device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].motion_config = config;
        app_aggregator_data_update_motion_config(device_index);
        m_schedule_device_list_print = true;
    }
}


void app_aggregator_on_quaternion_data(uint16_t conn_handle, ble_thingy_motion_quaternion_t quaternions)
{
    uint16_t device_index = device_list_search(conn_handle);
    if (device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].quaternions = quaternions;
        app_aggregator_data_update_quaternions(device_index);
        m_schedule_device_list_print = true;
    }
}

void app_aggregator_on_raw_motion_data(uint16_t conn_handle, ble_thingy_motion_raw_t data)
{
    uint16_t device_index = device_list_search(conn_handle);
    if (device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].raw_motion = data;
        app_aggregator_data_update_raw_motion(device_index);
        m_schedule_device_list_print = true;
    }
}

void app_aggregator_on_euler_data(uint16_t conn_handle, ble_thingy_motion_euler_t euler)
{
    uint16_t device_index = device_list_search(conn_handle);
    if (device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].euler = euler;
        app_aggregator_data_update_euler(device_index);
        m_schedule_device_list_print = true;
    }
}

void app_aggregator_on_heading_data(uint16_t conn_handle, ble_thingy_motion_heading_t heading)
{
    uint16_t device_index = device_list_search(conn_handle);
    if (device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].heading = heading;
        app_aggregator_data_update_heading(device_index);
        m_schedule_device_list_print = true;
    }
}

void app_aggregator_on_led_update(uint8_t led_state, uint32_t conn_handle_mask)
{
    for(int i = 0; i < MAX_NUMBER_OF_LINKS; i++)
    {
        if(m_link_info_list[i].conn_handle < 32 && ((conn_handle_mask & (1 << m_link_info_list[i].conn_handle)) != 0))
        {
            m_link_info_list[i].led_state = led_state;
            m_schedule_device_list_print = true;
        }
    }
}

void app_aggregator_on_led_color_set(uint8_t r, uint8_t g, uint8_t b, uint32_t conn_handle_mask)
{
    for(int i = 0; i < MAX_NUMBER_OF_LINKS; i++)
    {
        if(m_link_info_list[i].conn_handle < 32 && ((conn_handle_mask & (1 << m_link_info_list[i].conn_handle)) != 0))
        {
            NRF_LOG_DEBUG("Device %i color update: %i, %i, %i", m_link_info_list[i].conn_handle, r, g, b);
            m_link_info_list[i].led_color[APP_AGGR_COL_IND_RED]   = r;
            m_link_info_list[i].led_color[APP_AGGR_COL_IND_GREEN] = g;
            m_link_info_list[i].led_color[APP_AGGR_COL_IND_BLUE]  = b;
        }
    }
}

void app_aggregator_rssi_changed(uint16_t conn_handle, int8_t rssi)
{
    uint16_t device_index = device_list_search(conn_handle);
    if(device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].last_rssi = rssi;
        app_aggregator_data_update_rssi(device_index);
    }
}

void app_aggregator_phy_update(uint16_t conn_handle, uint8_t tx_phy, uint8_t rx_phy)
{
    uint16_t device_index = device_list_search(conn_handle);
    if(device_index != BLE_CONN_HANDLE_INVALID)
    {
        m_link_info_list[device_index].rf_phy = tx_phy;
        app_aggregator_data_update_by_index(device_index);
        m_schedule_device_list_print = true;
    }    
}

uint8_t   *data_ptr;
uint8_t   tmp_buffer[BLE_AGG_CMD_MAX_LENGTH];
uint16_t  length;
bool      reuse_packet = false;

bool app_aggregator_flush_ble_commands(void)
{

    uint32_t    err_code;
    if(!reuse_packet)
    {
        if(cmd_buffer_get(&data_ptr, &length))
        {
            //NRF_LOG_INFO("PCKBUF: \r\n");
            //NRF_LOG_HEXDUMP_INFO(data_ptr, length);
            err_code = ble_agg_cfg_service_string_send(m_ble_service, data_ptr, &length);
            if(err_code != NRF_SUCCESS)
            {
                memcpy(tmp_buffer, data_ptr, length);
                data_ptr = tmp_buffer;
                reuse_packet = true;
                return false;
            }
            return true;
        }
    }
    else
    {
        err_code = ble_agg_cfg_service_string_send(m_ble_service, data_ptr, &length);
        if(err_code == NRF_SUCCESS)
        {
            reuse_packet = false;
            return true;
        }   

    }
    return false;
}

void app_aggregator_clear_buffer(void)
{
    cmd_buffer_flush();
}

void app_aggregator_update_link_status(void)
{
    NRF_LOG_INFO("Clear buffer update link status");
    
    for(int i = 0; i < MAX_NUMBER_OF_LINKS; i++)
    {
        if(m_link_info_list[i].conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            // Prepare new connection packet for each link in the list
            tx_command_payload[0] = AGG_BLE_LINK_CONNECTED;
            tx_command_payload[1] = m_link_info_list[i].conn_handle >> 8;
            tx_command_payload[2] = m_link_info_list[i].conn_handle & 0xFF;
            tx_command_payload[3] = m_link_info_list[i].device_type;
            tx_command_payload[4] = m_link_info_list[i].button_state;
            tx_command_payload[5] = m_link_info_list[i].led_state;
            tx_command_payload[6] = m_link_info_list[i].led_color[APP_AGGR_COL_IND_RED];
            tx_command_payload[7] = m_link_info_list[i].led_color[APP_AGGR_COL_IND_GREEN];
            tx_command_payload[8] = m_link_info_list[i].led_color[APP_AGGR_COL_IND_BLUE];
            tx_command_payload[9] = m_link_info_list[i].last_rssi;
            tx_command_payload[10] = m_link_info_list[i].rf_phy;
            if(strlen((char *)m_link_info_list[i].adv_name) <= MAX_ADV_NAME_LENGTH)
            {
                memcpy(&tx_command_payload[11], m_link_info_list[i].adv_name, strlen((char *)m_link_info_list[i].adv_name));
                tx_command_payload_length = 11 + strlen((char *)m_link_info_list[i].adv_name);
            }
            else 
            {
                tx_command_payload_length = 11;
            }
            cmd_buffer_put(tx_command_payload, tx_command_payload_length);
            NRF_LOG_HEXDUMP_INFO(tx_command_payload, tx_command_payload_length);
        }
    }

